In [35]:
import numpy
import pandas

In [36]:
data = pandas.read_csv("loan_approval.csv")
df = pandas.DataFrame(data)
df

,name,city,income,credit_score,loan_amount,years_employed,points,loan_approved
0,Allison Hill,East Jill,113810,389,39698,27,50.0,False
1,Brandon Hall,New Jamesside,44592,729,15446,28,55.0,False
2,Rhonda Smith,Lake Roberto,33278,584,11189,13,45.0,False
3,Gabrielle Davis,West Melanieview,127196,344,48823,29,50.0,False
4,Valerie Gray,Mariastad,66048,496,47174,4,25.0,False
...,...,...,...,...,...,...,...,...
1995,James Schaefer,Robertton,92163,770,12251,13,85.0,True
1996,Diana Lin,New Frank,38799,635,48259,17,40.0,False
1997,Brandon Meyer,East Haley,41957,763,16752,5,60.0,True
1998,Jason Price,Adamland,139022,360,24031,35,55.0,False
1999,Nicole Brown,New Nathantown,41188,482,31397,6,20.0,False

In [37]:
df.isna().sum()

name              0
city              0
income            0
credit_score      0
loan_amount       0
years_employed    0
points            0
loan_approved     0
dtype: int64

In [38]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

df['loan_approved'] = le.fit_transform(df['loan_approved'])
df

,name,city,income,credit_score,loan_amount,years_employed,points,loan_approved
0,Allison Hill,East Jill,113810,389,39698,27,50.0,0
1,Brandon Hall,New Jamesside,44592,729,15446,28,55.0,0
2,Rhonda Smith,Lake Roberto,33278,584,11189,13,45.0,0
3,Gabrielle Davis,West Melanieview,127196,344,48823,29,50.0,0
4,Valerie Gray,Mariastad,66048,496,47174,4,25.0,0
...,...,...,...,...,...,...,...,...
1995,James Schaefer,Robertton,92163,770,12251,13,85.0,1
1996,Diana Lin,New Frank,38799,635,48259,17,40.0,0
1997,Brandon Meyer,East Haley,41957,763,16752,5,60.0,1
1998,Jason Price,Adamland,139022,360,24031,35,55.0,0
1999,Nicole Brown,New Nathantown,41188,482,31397,6,20.0,0

In [39]:
X = df.iloc[:,2:-1]
X
Y = df.iloc[:,-1]
Y

0       0
1       0
2       0
3       0
4       0
       ..
1995    1
1996    0
1997    1
1998    0
1999    0
Name: loan_approved, Length: 2000, dtype: int64

In [40]:
from sklearn.model_selection import train_test_split

X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.3)

X_train

      income  credit_score  loan_amount  years_employed  points
953    36826           411        42692              36    25.0
989    51465           427        14596               7    35.0
214    43947           391        43749              36    25.0
77    122349           789         8476               4    85.0
1015  135582           683        20613              23    80.0
...      ...           ...          ...             ...     ...
1456  141989           465        49008              12    50.0
870   148598           529         4077              17    60.0
1276  116662           396        36240              29    50.0
1367  129680           767         1032              16    95.0
1644   77049           337        44667              35    40.0

[1400 rows x 5 columns]

In [41]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

X_train = scaler.fit_transform(X_train)

X_train

X_test = scaler.transform(X_test)

X_test

array([[-1.57200213, -1.66672044, -0.11271709,  0.46218094, -1.70355378],
       [ 1.65594893, -0.1902918 ,  0.6116379 , -0.30700144, -0.08771686],
       [-1.31028651,  0.15089969,  1.26236437, -0.13607203, -0.89563532],
       ...,
       [ 0.47016451,  0.0454405 ,  0.35651472, -1.07618382, -0.62632917],
       [ 1.5001775 ,  0.49829467,  1.27132968, -0.99071911,  0.18158929],
       [-1.63400487,  0.9945732 , -0.05334836,  0.37671623, -0.35702302]],
      shape=(600, 5))

In [42]:
from sklearn.neighbors import KNeighborsClassifier

knn = KNeighborsClassifier()

model = knn.fit(X_train,Y_train)

In [43]:
y_pred = model.predict(X_test)

In [44]:
from sklearn.metrics import accuracy_score

print(accuracy_score(Y_test,y_pred))

0.9716666666666667

In [45]:
from sklearn.metrics import confusion_matrix

cm = confusion_matrix(Y_test,y_pred)
cm

array([[329,  14],
       [  3, 254]])